test/steel_ball_sedimentation/mix_semi/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;

/*
vertices
(
  (0 -8 -0.05)
  (1 -8 -0.05)
  (1 4 -0.05)
  (0 4 -0.05)
  (0 -8 0.05)
  (1 -8 0.05)
  (1 4 0.05)
  (0 4 0.05)
);
 */

vertices
(
  (0 0 0)
  (0.115 0 0)
  (0.115 0.03 0)
  (0 0.03 0)
  (0 0 0.6)
  (0.115 0 0.6)
  (0.115 0.03 0.6)
  (0 0.03 0.6)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (33 8 192) simpleGrading (1 1 1)
  // hex (0 1 2 3 4 5 6 7) (120 480 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
  wall outlet
  (
    (0 3 2 1)
  )
  wall walls
  (
    (2 6 5 1)
    (0 4 7 3)
    (3 7 6 2)
    (1 5 4 0)
  )
  wall inlet
  (
      (4 5 6 7)
  )
  /*
  empty frontAndBack 
  (
    (0 3 2 1)
    (4 5 6 7)
  )
   */
);

mergePatchPairs 
(
);
